#+TITLE: Emacs Setup
#+OPTIONS: toc:nil num:nil ^:nil

** Nix
#+BEGIN_SRC emacs-lisp
;(defvar nixos-options-json-file
;  (let* ((cmd
;          "echo /nix/store/jn75m2bvd8yfhx50yrflpbhyp0qdkiw2-options-json")
;          (dir (replace-regexp-in-string "\n\\'" ""
;                                         (shell-command-to-string cmd))))
;    (expand-file-name "share/doc/nixos/options.json" dir))
;  "Location of the options file.")

;(global-set-key (kbd "C-c C-S-n") 'helm-nixos-options)
;(add-to-list 'company-backends 'company-nixos-options)
(setq flycheck-command-wrapper-function
        (lambda (command) (apply 'nix-shell-command (nix-current-sandbox) command))
      flycheck-executable-find
        (lambda (cmd) (nix-executable-find (nix-current-sandbox) cmd)))
#+END_SRC

#+RESULTS:
| lambda | (cmd) | (nix-executable-find (nix-current-sandbox) cmd) |

